const 평균선형시간선택 = require('../select/averageTimeSelection');
test('평균 선형시간 선택 테스트', () => {
  expect(평균선형시간선택([5, 6, 7], 0, 2, 2)).toEqual(6);
});
test('평균 선형시간 선택 테스트', () => {
  expect(평균선형시간선택([7, 1, 2, 6, 4, 8, 10], 0, 6, 2)).toEqual(8);
});

test('평균 선형시간 선택 테스트', () => {
  expect(평균선형시간선택([7, 1, 2, 6, 4, 8, 10], 0, 6, 3)).toEqual(7);
});

test('평균 선형시간 선택 테스트', () => {
  expect(평균선형시간선택([7, 1, 2, 6, 4, 8, 10, 11], 0, 7, 1)).toEqual(11);
});
test('평균 선형시간 선택 테스트', () => {
  expect(평균선형시간선택([7, 7, 2, 6, 4, 8, 10, 11], 0, 7, 4)).toEqual(7);
});

test('평균 선형시간 선택 테스트', () => {
  expect(평균선형시간선택([1, 1, 1, 1, 1, 1, 1], 0, 6, 4)).toEqual(1);
});

test('평균 선형시간 선택 테스트', () => {
  expect(평균선형시간선택([1, 1, 1, 1, 1, 1, 2], 0, 6, 1)).toEqual(2);
});

test('평균 선형시간 선택 테스트', () => {
  expect(평균선형시간선택([1, 1, 1, 2, 1, 1, 1], 0, 6, 1)).toEqual(2);
});
